app/controllers/articles_controller.rb

  def destroy
    @article = Article.find(params[:id]).destroy;
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 6]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def update
    @article = Article.find(params[:id])
    @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "skeleton2.jpg"], ["image_file_size", 535897], ["image_updated_at", "2020-08-31 15:16:18.888421"], ["updated_at", "2020-08-31 15:16:20.224059"], ["id", 1]]